app/controllers/civilizations_controller.rb

  def index
    @civilizations = Civilization.all
---
SELECT "civilizations".* FROM "civilizations"

  def create
    @civilization = Civilization.new(civilization_params)

    if @civilization.save
---
INSERT INTO "civilizations" ("civ_name", "army_styles", "unique_units", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["civ_name", "The Buttholes"], ["army_styles", "{}"], ["unique_units", "{}"], ["created_at", "2020-05-11 07:34:18.499933"], ["updated_at", "2020-05-11 07:34:18.499933"]]

  def update
    if @civilization.update(civilization_params)
---
UPDATE "civilizations" SET "army_styles" = $1, "updated_at" = $2 WHERE "civilizations"."id" = $3  [["army_styles", "{Infantry,Monks,\"Really Cool Dudes\"}"], ["updated_at", "2020-05-13 01:17:00.649695"], ["id", 1]]

  def destroy
    @civilization.destroy
---
DELETE FROM "civilizations" WHERE "civilizations"."id" = $1  [["id", 36]]

    def set_civilization
      @civilization = Civilization.find(params[:id])
---
SELECT "civilizations".* FROM "civilizations" WHERE "civilizations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]